dmatking/m5stack-tab5-gps/sdkconfig.defaults
# Target: ESP32-P4 v1.x (Tab5 ships with v1.3)
# SELECTS_REV_LESS_V3 is required — REV_MIN_* options depend on it
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# CPU (360 MHz)
CONFIG_ESP_DEFAULT_CPU_FREQ_360=y
CONFIG_FREERTOS_HZ=1000

# Console — UART primary, USB JTAG secondary
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# PSRAM (HEX mode, 200 MHz)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
